# GetDisplayWith2DComp

## Description
Gets whether a 3D object in a symbol definition or plug-in object is shown when the specified 2D component is shown.<BR>
<BR>
                    Table - 2D components<BR>
2D component			Constant<BR>
Not Set			0<BR>
Top			1<BR>
Bottom			2<BR>
Top and Bottom Cut	                3<BR>
Front			4<BR>
Back			5<BR>
Front and Back Cut	                6<BR>
Left			7<BR>
Right			8<BR>
Left and Right Cut	                9   <BR>

```pascal
FUNCTION GetDisplayWith2DComp(
				objectHandle : HANDLE;
				component    : INTEGER): BOOLEAN;
```

```python
def vs.GetDisplayWith2DComp(objectHandle, component):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|3D object handle.|
|component|INTEGER|2D component.|

## Examples
```pascal
resultOK := GetDisplayWith2DComp(objectHandle, 1);
```
```python
import vs

# Gets whether a 3D object in a symbol definition or plug-in object is shown
# when the specified 2D component is shown.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer
component = 1

ok = vs.GetDisplayWith2DComp(objectHandle, component)
if ok:
    vs.Message('GetDisplayWith2DComp succeeded')
else:
    vs.Message('GetDisplayWith2DComp failed')
```

## Version
Availability: from Vectorworks 2019

## Category
* Objects - Custom